tutorials/03steadyNSTurb/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
17780
(
0.0025
0
0.0025
0
0.0025
0
0.0025
0
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
-0.0025
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
0.00222222
0.00222222
0.00222222
0.00222222
0.00222222
0.00222222
0.00222222
0.00222222
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
}

